/******************************************************************************
 *  CVS version:
 *     $Id: general.h,v 1.1 2005/04/07 10:31:32 nickie Exp $
 ******************************************************************************
 *
 *  C header file : general.h
 *  Project       : Llama Compiler
 *  Version       : 1.0 alpha
 *  Description   : Generic definitions
 *
 *  Comments: (in Greek iso-8859-7)
 *  ---------
 *  Εθνικό Μετσόβιο Πολυτεχνείο.
 *  Σχολή Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών.
 *  Τομέας Τεχνολογίας Πληροφορικής και Υπολογιστών.
 *  Εργαστήριο Τεχνολογίας Λογισμικού
 */


#ifndef __GENERAL_H__
#define __GENERAL_H__


/* ---------------------------------------------------------------------
   ---------------------------- Header files ---------------------------
   --------------------------------------------------------------------- */

#include <stdbool.h>
#include <stdlib.h>


/* ---------------------------------------------------------------------
   --------------------------- Generic flags ---------------------------
   --------------------------------------------------------------------- */

extern bool flagVerbose;


/* ---------------------------------------------------------------------
   ------------------- Τύποι αναπαράστασης σταθερών --------------------
   --------------------------------------------------------------------- */

typedef int    RepInt;
typedef char * RepChar;
typedef double RepFloat;
typedef char * RepString;


/* ---------------------------------------------------------------------
   ------------- Ελεγχόμενος τερματισμός του μεταγλωττιστή -------------
   --------------------------------------------------------------------- */

void terminate (int);


/* ---------------------------------------------------------------------
   ----------- Πρωτότυπα των συναρτήσεων διαχείρισης μνήμης ------------
   --------------------------------------------------------------------- */

void * new    (size_t);
void   delete (void *);


/* ---------------------------------------------------------------------
   ------- Αρχείο εισόδου του μεταγλωττιστή και αριθμός γραμμής --------
   --------------------------------------------------------------------- */

extern char * filename;
extern int linecount;


/* ---------------------------------------------------------------------
   --------------------------- Αναγνωριστικά ---------------------------
   --------------------------------------------------------------------- */

typedef struct Identifier_tag * Identifier;

Identifier id_make (const char *);
const char * id_name (Identifier);

void id_reset ();


#endif
